nikolai-baschinski/STM32F767ZI_Random_number_on_LCD_ILI9341/Src/GPIO.c
#include "stm32f767xx.h"
#include "GPIO.h"
#include "ProcessImage.h"

struct GPIO* loc_p_gpio = 0;

void init_GPIO(struct GPIO* p_gpio)
{
  loc_p_gpio = p_gpio;

  RCC->AHB1ENR |= RCC_AHB1ENR_GPIOAEN; // enable peripheral clock for Port A
  RCC->AHB1ENR |= RCC_AHB1ENR_GPIOBEN; // enable peripheral clock for Port B
  RCC->AHB1ENR |= RCC_AHB1ENR_GPIOCEN; // enable peripheral clock for Port C
  RCC->AHB1ENR |= RCC_AHB1ENR_GPIOGEN; // enable peripheral clock for Port G

  GPIOC->MODER |= (1<<0); // PC0 as output for CS (BME280)
  GPIOB->MODER |= (1<<0); // PB0 as output (LED1)
  GPIOG->MODER |= (1<<0); // PG0 as output (Test-Pin)
  GPIOA->MODER |= (2<<10) | (2<<12) | (2<<14); // Alternate functions for PA5 (SPI1_CLK), PA6 (SP1_MISO) and PA7 (SPI1_MOSI)
  GPIOA->MODER |= (1<<0);  // PA0 as output for DC (LCD)
  GPIOB->MODER |= (1<<12); // PB6 as output for CS (LCD)
  GPIOB->MODER |= (1<<18); // PB9 as output for RST (LCD)
  GPIOB->MODER |= (2<<26) | (2<<30); // Alternate functions for PB13 (SPI2_CLK) and PB15 (SPI2_MOSI)
  GPIOC->MODER |= (2<<4); // Alternate function for PC2 (SPI2_MISO)

  GPIOA->OSPEEDR |= (3<<0) | (3<<10) | (3<<12) | (3<<14); // high speed PA0 (SS), PA5 (SPI1_CLK), PA6 (SPI1_MISO) and PA7 (SPI1_MOSI)
  GPIOB->OSPEEDR |= (3<<26) | (3<<30);
  GPIOC->OSPEEDR |= (3<<4);

  GPIOA->AFR[0] |= (5<<20) | (5<<24) | (5<<28); // Alternate function 5 for SPI1
  GPIOB->AFR[1] |= (5<<20) | (5<<28); // Alternate function 5 for SPI2
  GPIOC->AFR[0] |= (5<<8);

  GPIOC->PUPDR &= ~(3 << (13 * 2));
  GPIOC->PUPDR |=  (2 << (13 * 2));   // Pull-down for user button B1

}

void GPIO_toggle_green_LED()
{
  GPIOB->ODR & 1 ? (GPIOB->BSRR = (1<<16)) : (GPIOB->BSRR = (1<<0));
}

uint8_t GPIO_button_pushed()
{
  uint8_t rv = 0;

  if(loc_p_gpio->button_pushed_memory == 0 && loc_p_gpio->button_pushed == 1) {
    loc_p_gpio->debounce_counter = 0;
    rv = 1;
  }
  return rv;
}

void GPIO_toggle_Pin_PG0(void)
{
  if (GPIOG->ODR & (1U << 0)) {
    GPIOG->BSRR = (1U << (0 + 16)); // Reset PG0
  } else {
    GPIOG->BSRR = (1U << 0);        // Set PG0
  }
}

void cyclic_GPIO(struct ProcessImage* p_pi)
{
  if(p_pi->cntr_10ms % 100 == 0) {
    GPIO_toggle_green_LED();
  }

  p_pi->gpio.button_pushed_memory = p_pi->gpio.button_pushed;

  if(GPIOC->IDR & (1 << 13)) {
    p_pi->gpio.debounce_counter++;
      if(p_pi->gpio.debounce_counter >= 5) {
        p_pi->gpio.button_pushed = 1;
    }
  } else {
    p_pi->gpio.button_pushed = 0;
  }
}
